MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFR32FG1P132F128GM48/mcu.h
/***************************************************************************//**
 * @file
 * @brief CMSIS Cortex-M Peripheral Access Layer Header File
 *        for EFR32FG1P132F128GM48
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

#ifndef EFR32FG1P132F128GM48_H
#define EFR32FG1P132F128GM48_H

#ifdef __cplusplus
extern "C" {
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * @defgroup EFR32FG1P132F128GM48 EFR32FG1P132F128GM48
 * @{
 ******************************************************************************/

/** Interrupt Number Definition */
typedef enum IRQn{
/******  Cortex-M4 Processor Exceptions Numbers ********************************************/
  NonMaskableInt_IRQn   = -14,              /*!< 2  Cortex-M4 Non Maskable Interrupt      */
  HardFault_IRQn        = -13,              /*!< 3  Cortex-M4 Hard Fault Interrupt        */
  MemoryManagement_IRQn = -12,              /*!< 4  Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn         = -11,              /*!< 5  Cortex-M4 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10,              /*!< 6  Cortex-M4 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,               /*!< 11 Cortex-M4 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,               /*!< 12 Cortex-M4 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,               /*!< 14 Cortex-M4 Pend SV Interrupt           */
  SysTick_IRQn          = -1,               /*!< 15 Cortex-M4 System Tick Interrupt       */

/******  EFR32FG1P Peripheral Interrupt Numbers ********************************************/

  EMU_IRQn              = 0,  /*!< 16+0 EFR32 EMU Interrupt */
  FRC_PRI_IRQn          = 1,  /*!< 16+1 EFR32 FRC_PRI Interrupt */
  WDOG0_IRQn            = 2,  /*!< 16+2 EFR32 WDOG0 Interrupt */
  FRC_IRQn              = 3,  /*!< 16+3 EFR32 FRC Interrupt */
  MODEM_IRQn            = 4,  /*!< 16+4 EFR32 MODEM Interrupt */
  RAC_SEQ_IRQn          = 5,  /*!< 16+5 EFR32 RAC_SEQ Interrupt */
  RAC_RSM_IRQn          = 6,  /*!< 16+6 EFR32 RAC_RSM Interrupt */
  BUFC_IRQn             = 7,  /*!< 16+7 EFR32 BUFC Interrupt */
  LDMA_IRQn             = 8,  /*!< 16+8 EFR32 LDMA Interrupt */
  GPIO_EVEN_IRQn        = 9,  /*!< 16+9 EFR32 GPIO_EVEN Interrupt */
  TIMER0_IRQn           = 10, /*!< 16+10 EFR32 TIMER0 Interrupt */
  USART0_RX_IRQn        = 11, /*!< 16+11 EFR32 USART0_RX Interrupt */
  USART0_TX_IRQn        = 12, /*!< 16+12 EFR32 USART0_TX Interrupt */
  ACMP0_IRQn            = 13, /*!< 16+13 EFR32 ACMP0 Interrupt */
  ADC0_IRQn             = 14, /*!< 16+14 EFR32 ADC0 Interrupt */
  IDAC0_IRQn            = 15, /*!< 16+15 EFR32 IDAC0 Interrupt */
  I2C0_IRQn             = 16, /*!< 16+16 EFR32 I2C0 Interrupt */
  GPIO_ODD_IRQn         = 17, /*!< 16+17 EFR32 GPIO_ODD Interrupt */
  TIMER1_IRQn           = 18, /*!< 16+18 EFR32 TIMER1 Interrupt */
  USART1_RX_IRQn        = 19, /*!< 16+19 EFR32 USART1_RX Interrupt */
  USART1_TX_IRQn        = 20, /*!< 16+20 EFR32 USART1_TX Interrupt */
  LEUART0_IRQn          = 21, /*!< 16+21 EFR32 LEUART0 Interrupt */
  PCNT0_IRQn            = 22, /*!< 16+22 EFR32 PCNT0 Interrupt */
  CMU_IRQn              = 23, /*!< 16+23 EFR32 CMU Interrupt */
  MSC_IRQn              = 24, /*!< 16+24 EFR32 MSC Interrupt */
  CRYPTO_IRQn           = 25, /*!< 16+25 EFR32 CRYPTO Interrupt */
  LETIMER0_IRQn         = 26, /*!< 16+26 EFR32 LETIMER0 Interrupt */
  AGC_IRQn              = 27, /*!< 16+27 EFR32 AGC Interrupt */
  PROTIMER_IRQn         = 28, /*!< 16+28 EFR32 PROTIMER Interrupt */
  RTCC_IRQn             = 29, /*!< 16+29 EFR32 RTCC Interrupt */
  SYNTH_IRQn            = 30, /*!< 16+30 EFR32 SYNTH Interrupt */
  CRYOTIMER_IRQn        = 31, /*!< 16+31 EFR32 CRYOTIMER Interrupt */
  RFSENSE_IRQn          = 32, /*!< 16+32 EFR32 RFSENSE Interrupt */
  FPUEH_IRQn            = 33, /*!< 16+33 EFR32 FPUEH Interrupt */
} IRQn_Type;

/***************************************************************************//**
 * @defgroup EFR32FG1P132F128GM48_Core Core
 * @{
 * @brief Processor and Core Peripheral Section
 ******************************************************************************/
#define __MPU_PRESENT             1U /**< Presence of MPU  */
#define __FPU_PRESENT             1U /**< Presence of FPU  */
#define __VTOR_PRESENT            1U /**< Presence of VTOR register in SCB */
#define __NVIC_PRIO_BITS          3U /**< NVIC interrupt priority bits */
#define __Vendor_SysTickConfig    0U /**< Is 1 if different SysTick counter is used */

/** @} End of group EFR32FG1P132F128GM48_Core */

/***************************************************************************//**
 * @defgroup EFR32FG1P132F128GM48_Part Part
 * @{
 ******************************************************************************/

/** Part family */
#define _EFR32_FLEX_FAMILY                      1                               /**< FLEX Gecko RF SoC Family  */
#define _EFR_DEVICE                                                             /**< Silicon Labs EFR-type RF SoC */
#define _SILICON_LABS_32B_SERIES_1                                              /**< Silicon Labs series number */
#define _SILICON_LABS_32B_SERIES                1                               /**< Silicon Labs series number */
#define _SILICON_LABS_32B_SERIES_1_CONFIG_1                                     /**< Series 1, Configuration 1 */
#define _SILICON_LABS_32B_SERIES_1_CONFIG       1                               /**< Series 1, Configuration 1 */
#define _SILICON_LABS_GECKO_INTERNAL_SDID       80                              /**< Silicon Labs internal use only, may change any time */
#define _SILICON_LABS_GECKO_INTERNAL_SDID_80                                    /**< Silicon Labs internal use only, may change any time */
#define _SILICON_LABS_EFR32_RADIO_SUBGHZ        1                               /**< Radio supports Sub-GHz */
#define _SILICON_LABS_EFR32_RADIO_2G4HZ         2                               /**< Radio supports 2.4 GHz */
#define _SILICON_LABS_EFR32_RADIO_DUALBAND      3                               /**< Radio supports dual band */
#define _SILICON_LABS_EFR32_RADIO_TYPE          _SILICON_LABS_EFR32_RADIO_2G4HZ /**< Radio type */
#define _SILICON_LABS_32B_PLATFORM_2                                            /**< @deprecated Silicon Labs platform name */
#define _SILICON_LABS_32B_PLATFORM              2                               /**< @deprecated Silicon Labs platform name */
#define _SILICON_LABS_32B_PLATFORM_2_GEN_1                                      /**< @deprecated Platform 2, generation 1 */
#define _SILICON_LABS_32B_PLATFORM_2_GEN        1                               /**< @deprecated Platform 2, generation 1 */

